
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/personal_demos/week_7_terraform/runs/run-jonxZq1g1vhBcMaX

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.archive_file.zip1: Reading...
data.archive_file.zip2: Reading...
data.archive_file.zip1: Read complete after 0s [id=edcd38b109b22030f1e2124a7f6e6de1faac9837]
data.archive_file.zip2: Read complete after 0s [id=09a513526144a92c9ca50e66d634138a799bbf74]
aws_iam_role.writeRole: Refreshing state... [id=myWriteRole]
aws_iam_role.readRole: Refreshing state... [id=myReadRole]
aws_dynamodb_table.dbtable: Refreshing state... [id=myTable]
aws_api_gateway_rest_api.apiLambda: Refreshing state... [id=nbmcei0lfk]
aws_api_gateway_resource.writeResource: Refreshing state... [id=m46lj6]
aws_api_gateway_resource.readResource: Refreshing state... [id=yt1k8n]
aws_api_gateway_method.readMethod: Refreshing state... [id=agm-nbmcei0lfk-yt1k8n-POST]
aws_api_gateway_method.writeMethod: Refreshing state... [id=agm-nbmcei0lfk-m46lj6-POST]
aws_iam_role_policy.read_policy: Refreshing state... [id=myReadRole:lambda_read_policy]
aws_iam_role_policy.write_policy: Refreshing state... [id=myWriteRole:lambda_write_policy]
aws_lambda_function.readLambda: Refreshing state... [id=readLambda]
aws_lambda_function.writeLambda: Refreshing state... [id=writeLambda]
aws_api_gateway_integration.readInt: Refreshing state... [id=agi-nbmcei0lfk-yt1k8n-POST]
aws_lambda_permission.readPermission: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_lambda_permission.writePermission: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.writeInt: Refreshing state... [id=agi-nbmcei0lfk-m46lj6-POST]
aws_api_gateway_deployment.apideploy: Refreshing state... [id=n79dxn]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_api_gateway_method.readMethod has been deleted
  - resource "aws_api_gateway_method" "readMethod" {
      - http_method          = "POST" -> null
        id                   = "agm-nbmcei0lfk-yt1k8n-POST"
        # (7 unchanged attributes hidden)
    }

  # aws_api_gateway_method.writeMethod has been deleted
  - resource "aws_api_gateway_method" "writeMethod" {
      - http_method          = "POST" -> null
        id                   = "agm-nbmcei0lfk-m46lj6-POST"
        # (7 unchanged attributes hidden)
    }

  # aws_api_gateway_resource.readResource has been deleted
  - resource "aws_api_gateway_resource" "readResource" {
      - id          = "yt1k8n" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_api_gateway_resource.writeResource has been deleted
  - resource "aws_api_gateway_resource" "writeResource" {
      - id          = "m46lj6" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_api_gateway_rest_api.apiLambda has been deleted
  - resource "aws_api_gateway_rest_api" "apiLambda" {
      - execution_arn                = "arn:aws:execute-api:us-east-2:153042419275:nbmcei0lfk" -> null
      - id                           = "nbmcei0lfk" -> null
        name                         = "myAPI"
      - root_resource_id             = "6ibxijhfo1" -> null
        tags                         = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_deployment.apideploy must be replaced
-/+ resource "aws_api_gateway_deployment" "apideploy" {
      ~ created_date  = "2022-10-03T04:15:20Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-2:153042419275:nbmcei0lfk/Prod" -> (known after apply)
      ~ id            = "n79dxn" -> (known after apply)
      ~ invoke_url    = "https://nbmcei0lfk.execute-api.us-east-2.amazonaws.com/Prod" -> (known after apply)
      ~ rest_api_id   = "nbmcei0lfk" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_integration.readInt will be created
  + resource "aws_api_gateway_integration" "readInt" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:153042419275:function:readLambda/invocations"
    }

  # aws_api_gateway_integration.writeInt will be created
  + resource "aws_api_gateway_integration" "writeInt" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:153042419275:function:writeLambda/invocations"
    }

  # aws_api_gateway_method.readMethod will be created
  + resource "aws_api_gateway_method" "readMethod" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_method.writeMethod will be created
  + resource "aws_api_gateway_method" "writeMethod" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_resource.readResource will be created
  + resource "aws_api_gateway_resource" "readResource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "readdb"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_resource.writeResource will be created
  + resource "aws_api_gateway_resource" "writeResource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "writedb"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.apiLambda will be created
  + resource "aws_api_gateway_rest_api" "apiLambda" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "myAPI"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_lambda_permission.readPermission must be replaced
-/+ resource "aws_lambda_permission" "readPermission" {
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      ~ source_arn          = "arn:aws:execute-api:us-east-2:153042419275:nbmcei0lfk/Prod/POST/readdb" -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.writePermission must be replaced
-/+ resource "aws_lambda_permission" "writePermission" {
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      ~ source_arn          = "arn:aws:execute-api:us-east-2:153042419275:nbmcei0lfk/Prod/POST/writedb" -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 10 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ base_url = "https://nbmcei0lfk.execute-api.us-east-2.amazonaws.com/Prod" -> (known after apply)

```
</details>
*Pusher: @SalvadorM271, Action: `pull_request`*